/******************************************************************************************
 * Data Structures in C++
 * ISBN: 7-302-26883-3 & 7-302-29652-2
 * Junhui DENG, deng@tsinghua.edu.cn
 * Computer Science & Technology, Tsinghua University
 * Copyright (c) 2011. All rights reserved.
 ******************************************************************************************/

#pragma once

/******************************************************************************************
 *将Stack各方法的实现部分，简洁地引入Stack.h
 *效果等同于将这些实现直接汇入Stack.h
 *在export尚未被编译器支持前，如此可实现H与CPP文件分离，以便课程讲解
******************************************************************************************/
